Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/Keil.TM4C_DFP.pdsc
      <!-- *************************  Device 'TM4C1231H6PM'  ***************************** -->
      <device Dname="TM4C1231H6PM">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C1231H6PM"/>
        <debug      svd="SVD/TM4C123/TM4C1231H6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1231H6PZ'  ***************************** -->
      <device Dname="TM4C1231H6PZ">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C1231H6PZ"/>
        <debug      svd="SVD/TM4C123/TM4C1231H6PZ.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1232C3PM'  ***************************** -->
      <device Dname="TM4C1232C3PM">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C1232C3PM"/>
        <debug      svd="SVD/TM4C123/TM4C1232C3PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x008000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x003000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_32.FLM"     start="0x00000000"  size="0x008000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1232D5PM'  ***************************** -->
      <device Dname="TM4C1232D5PM">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C1232D5PM"/>
        <debug      svd="SVD/TM4C123/TM4C1232D5PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x010000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x006000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_64.FLM"     start="0x00000000"  size="0x010000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1232E6PM'  ***************************** -->
      <device Dname="TM4C1232E6PM">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C1232E6PM"/>
        <debug      svd="SVD/TM4C123/TM4C1232E6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1232H6PM'  ***************************** -->
      <device Dname="TM4C1232H6PM">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C1232H6PM"/>
        <debug      svd="SVD/TM4C123/TM4C1232H6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1233C3PM'  ***************************** -->
      <device Dname="TM4C1233C3PM">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C1233C3PM"/>
        <debug      svd="SVD/TM4C123/TM4C1233C3PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x008000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x003000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_32.FLM"     start="0x00000000"  size="0x008000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1233D5PM'  ***************************** -->
      <device Dname="TM4C1233D5PM">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C1233D5PM"/>
        <debug      svd="SVD/TM4C123/TM4C1233D5PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x010000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x006000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_64.FLM"     start="0x00000000"  size="0x010000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1233D5PZ'  ***************************** -->
      <device Dname="TM4C1233D5PZ">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C1233D5PZ"/>
        <debug      svd="SVD/TM4C123/TM4C1233D5PZ.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x010000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x006000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_64.FLM"     start="0x00000000"  size="0x010000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1233E6PM'  ***************************** -->
      <device Dname="TM4C1233E6PM">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C1233E6PM"/>
        <debug      svd="SVD/TM4C123/TM4C1233E6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1233E6PZ'  ***************************** -->
      <device Dname="TM4C1233E6PZ">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C1233E6PZ"/>
        <debug      svd="SVD/TM4C123/TM4C1233E6PZ.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

