Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/Keil.TM4C_DFP.pdsc
      <!-- *************************  Device 'TM4C123BE6PM'  ***************************** -->
      <device Dname="TM4C123BE6PM">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C123BE6PM"/>
        <debug      svd="SVD/TM4C123/TM4C123BE6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123BE6PZ'  ***************************** -->
      <device Dname="TM4C123BE6PZ">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C123BE6PZ"/>
        <debug      svd="SVD/TM4C123/TM4C123BE6PZ.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123BH6PGE'  ***************************** -->
      <device Dname="TM4C123BH6PGE">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C123BH6PGE"/>
        <debug      svd="SVD/TM4C123/TM4C123BH6PGE.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123BH6PM'  ***************************** -->
      <device Dname="TM4C123BH6PM">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C123BH6PM"/>
        <debug      svd="SVD/TM4C123/TM4C123BH6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123BH6PZ'  ***************************** -->
      <device Dname="TM4C123BH6PZ">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C123BH6PZ"/>
        <debug      svd="SVD/TM4C123/TM4C123BH6PZ.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123BH6ZRB'  ***************************** -->
      <device Dname="TM4C123BH6ZRB">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C123BH6ZRB"/>
        <debug      svd="SVD/TM4C123/TM4C123BH6ZRB.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123FE6PM'  ***************************** -->
      <device Dname="TM4C123FE6PM">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C123FE6PM"/>
        <debug      svd="SVD/TM4C123/TM4C123FE6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123FH6PM'  ***************************** -->
      <device Dname="TM4C123FH6PM">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C123FH6PM"/>
        <debug      svd="SVD/TM4C123/TM4C123FH6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123GE6PM'  ***************************** -->
      <device Dname="TM4C123GE6PM">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C123GE6PM"/>
        <debug      svd="SVD/TM4C123/TM4C123GE6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123GE6PZ'  ***************************** -->
      <device Dname="TM4C123GE6PZ">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C123GE6PZ"/>
        <debug      svd="SVD/TM4C123/TM4C123GE6PZ.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123GH6PGE'  ***************************** -->
      <device Dname="TM4C123GH6PGE">
        <compile header="Device/Include/TM4C123/TM4C123.h"  define="TM4C123GH6PGE"/>
        <debug      svd="SVD/TM4C123/TM4C123GH6PGE.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

