Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/Keil.TM4C_DFP.pdsc
      <!-- *************************  Device 'TM4C129ENCPDT'  ***************************** -->
      <device Dname="TM4C129ENCPDT">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C129ENCPDT"/>
        <debug      svd="SVD/TM4C129/TM4C129ENCPDT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C129ENCZAD'  ***************************** -->
      <device Dname="TM4C129ENCZAD">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C129ENCZAD"/>
        <debug      svd="SVD/TM4C129/TM4C129ENCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C129LNCZAD'  ***************************** -->
      <device Dname="TM4C129LNCZAD">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C129LNCZAD"/>
        <debug      svd="SVD/TM4C129/TM4C129LNCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C129XKCZAD'  ***************************** -->
      <device Dname="TM4C129XKCZAD">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C129XKCZAD"/>
        <debug      svd="SVD/TM4C129/TM4C129XKCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x080000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_512.FLM"    start="0x00000000"  size="0x080000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C129XNCZAD'  ***************************** -->
      <device Dname="TM4C129XNCZAD">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C129XNCZAD"/>
        <debug      svd="SVD/TM4C129/TM4C129XNCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      </subFamily>

    </family>
  </devices>


  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="TM4C123x">
      <description>Texas Instruments TM4C123x Series devices</description>
      <require Dvendor="Texas Instruments:16" Dname="TM4C123*"/>
    </condition>
    <condition id="TM4C129x">
      <description>Texas Instruments TM4C129x Series devices</description>
      <require Dvendor="Texas Instruments:16" Dname="TM4C129*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TM4C123x CMSIS">
      <description>Texas Instruments TM4C123x Series and CMSIS-CORE</description>
      <require condition="TM4C123x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TM4C129x CMSIS">
      <description>Texas Instruments TM4C129x Series and CMSIS-CORE</description>
      <require condition="TM4C129x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>


  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="TM4C123x CMSIS">
      <description>System Startup for Texas Instruments TM4C123x Series</description>
      <files>
        <!-- header file (and device include path) -->
        <file category="header"  name="Device/Include/TM4C123/TM4C123.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_TM4C123.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_TM4C123.c"       attr="config" version="1.0.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TM4C129x CMSIS">
      <description>System Startup for Texas Instruments TM4C123x Series</description>
      <files>
        <!-- header file (and device include path) -->
        <file category="header"  name="Device/Include/TM4C129/TM4C129.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_TM4C129.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_TM4C129.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

  </components>


  <boards>
    <board vendor="Texas Instruments" name="EK-TM4C1294XL" revision="Rev. A" salesContact="https://estore.ti.com/contactus.aspx" orderForm="https://estore.ti.com/">
      <description>Texas Instruments EK-TM4C1294XL LaunchPad</description>
      <image small="Images/EK-TM4C1294XL_small.png" large="Images/EK-TM4C1294XL_large.png"/>
      <book category="overview"  name="http://http://www.ti.com/tool/ek-tm4c1294xl" title="Tiva C Series TM4C1294 Connected LaunchPad Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="Texas Instruments:16" Dname="TM4C1294NCPDT"/>
      <compatibleDevice deviceIndex="0" Dvendor="Texas Instruments:16" DsubFamily="TM4C129x Series"/>
      <feature type="XTAL"            n="25000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="ConnOther"       n="2"              name="BoosterPack Connector"/>
      <feature type="DIO"             n="98"             name="Digital I/Os (Breadboard Adapter)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Host/OTG/Device interface (USB Micro AB receptacle)"/>
      <feature type="ETH"             n="1"              name="10/100 Ethernet Port"/>
      <feature type="Button"          n="4"              name="Push-Buttons: Reset, Wake, 2 x USER"/>
      <feature type="LED"             n="4"              name="I/O Port LEDs"/>
      <feature type="ODbg"            n="1"              name="on-board ICDI"/>
    </board>

