Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/Keil.TM4C_DFP.pdsc
    <board vendor="Texas Instruments" name="DK-TM4C129x" revision="Ver 1.3" salesContact="https://estore.ti.com/contactus.aspx" orderForm="https://estore.ti.com/">
      <description>Texas Instruments DK-TM4C129x Development Kit</description>
      <image small="Images/DK-TM4C129x_small.png" large="Images/DK-TM4C129x_large.png"/>
      <book category="overview"  name="http://www.ti.com/tool/DK-TM4C129X" title="DK-TM4C129X Connected Development Kit Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="Texas Instruments:16" Dname="TM4C129XNCZAD"/>
      <compatibleDevice deviceIndex="0" Dvendor="Texas Instruments:16" DsubFamily="TM4C129x Series"/>
      <feature type="XTAL"            n="25000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="PWR"             n="5"              name="External Power Supply"/>
      <feature type="MemCard"         n="1"              name="microSD Card Holder"/>
      <feature type="DIO"             n="64"             name="Digital I/Os (ULPI, MII, RMII, and EPI)"/>
      <feature type="ConnOther"       n="2"              name="BoosterPack Connector"/>
      <feature type="USB"             n="1"              name="USB 2.0 Host/OTG/Device interface (USB Micro AB receptacle)"/>
      <feature type="ETH"             n="1"              name="10/100 Ethernet Port"/>
      <feature type="GLCD"            n="1"  m="240.320" name="Kentec K350QVG-V2-F 320x240 RGB resistive touch screen"/>
      <feature type="Speaker"         n="1"              name="Speaker with amplifier"/>
      <feature type="TempSens"        n="1"              name="Temperature Sensor"/>
      <feature type="Button"          n="4"              name="Push-Buttons: Reset, 3 x USER"/>
      <feature type="LED"             n="3"              name="I/O Port LEDs"/>
      <feature type="ODbg"            n="1"              name="on-board ICDI"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>

  </boards>


  <examples>
    <!-- EK-TM4C129XL Demo Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/TI/EK-TM4C1294XL/Blinky">
      <description>Blinky example</description>
      <board name="EK-TM4C1294XL" vendor="Texas Instruments" Dvendor="Texas Instruments:16" Dname="TM4C1294NCPDT"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/TI/EK-TM4C1294XL/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="EK-TM4C1294XL" vendor="Texas Instruments" Dvendor="Texas Instruments:16" Dname="TM4C1294NCPDT"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- DK-TM4C129x Demo Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/TI/DK-TM4C129x/Blinky">
      <description>Blinky example</description>
      <board name="DK-TM4C129x" vendor="Texas Instruments" Dvendor="Texas Instruments:16" Dname="TM4C129XCNZAD"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/TI/DK-TM4C129x/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="DK-TM4C129x" vendor="Texas Instruments" Dvendor="Texas Instruments:16" Dname="TM4C129XCNZAD"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

  </examples>

</package>
